<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//FI">

<!--Converted with jLaTeX2HTML 2002 (1.62) JA patch-1.4
patched version by:  Kenshi Muto, Debian Project.
LaTeX2HTML 2002 (1.62),
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>4.2 Word - sana</TITLE>
<META NAME="description" CONTENT="4.2 Word - sana">
<META NAME="keywords" CONTENT="annotation_guide">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="jLaTeX2HTML v2002 JA patch-1.4">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="annotation_guide.css">

<LINK REL="next" HREF="node21.html">
<LINK REL="previous" HREF="node19.html">
<LINK REL="up" HREF="node18.html">
<LINK REL="next" HREF="node21.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html1021"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html1015"
  HREF="node18.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html1009"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html1017"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html1019"
  HREF="node63.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<!--End of Navigation Panel-->
<!--Table of Child-Links-->
<A NAME="CHILD_LINKS"><STRONG>Aliluvut</STRONG></A>

<UL>
<LI><A NAME="tex2html1023"
  HREF="node20.html#SECTION03321000000000000000">Määritelmä ja käyttötarkoitus</A>
<LI><A NAME="tex2html1024"
  HREF="node20.html#SECTION03322000000000000000">Paikantaminen ja rajaaminen</A>
<UL>
<LI><A NAME="tex2html1025"
  HREF="node20.html#SECTION03322100000000000000">4.2.0.1 Geminaatta (kaksoiskonsonantti) sanarajalla</A>
<LI><A NAME="tex2html1026"
  HREF="node20.html#SECTION03322200000000000000">4.2.0.2 Pitkä vokaali sanarajalla</A>
<LI><A NAME="tex2html1027"
  HREF="node20.html#SECTION03322300000000000000">4.2.0.3 Puhunnoksenloppuiset/-alkuiset saneet</A>
</UL>
<BR>
<LI><A NAME="tex2html1028"
  HREF="node20.html#SECTION03323000000000000000">Riippuvuudet muista yksiköistä</A>
<LI><A NAME="tex2html1029"
  HREF="node20.html#SECTION03324000000000000000">Kuvauksen valinta</A>
</UL>
<!--End of Table of Child-Links-->
<HR>

<H1><A NAME="SECTION03320000000000000000"></A><A NAME="sub:Word-Sana"></A><A NAME="330"></A><A NAME="331"></A>
<BR>
4.2 Word - sana
</H1>

<P>

<H2><A NAME="SECTION03321000000000000000">
M&#228;&#228;ritelm&#228; ja k&#228;ytt&#246;tarkoitus</A>
</H2>

<P>
Puheen yksikk&#246;, jolla on itsen&#228;inen merkitys ja joka voi esiinty&#228;
my&#246;s yksin&#228;&#228;n. Sanayksik&#246;ll&#228; tarkoitetaan t&#228;ss&#228; itse asiassa kimppua
yhteen saneeseen liittyvi&#228; piirteit&#228;. Saneeseen liittyy ensisijaisesti
sen l&#228;hes ortografinen litteraatti (ts. sama asu kuin foneettisen
puhunnoksen kuvauksessa), mutta yksik&#246;st&#228; voidaan annotaatiossa mainita
my&#246;s esimerkiksi fonologinen kuvaus, perusmuoto, morfologisia piirteit&#228;,
vastaava sananmuoto kirjoitetussa kieless&#228; jne. Puh-editorissa n&#228;m&#228;
piirteet on kuitenkin m&#228;&#228;ritelt&#228;v&#228; erikseen.

<P>

<H2><A NAME="SECTION03322000000000000000">
Paikantaminen ja rajaaminen</A>
</H2>

<P>
Sanakerros on suositeltavaa nimikoida vasta foonikerroksen j&#228;lkeen
ja mieluiten tavukerroksen annotoinnin yhteydess&#228;. Puh-editorilla
sanakerroksen pohja voidaan generoida my&#246;s jo annotoidusta puhunnoskerroksesta,
mik&#228;li t&#228;m&#228; on jo olemassa. T&#228;ll&#246;in muodostuu ns. kelluvia<A NAME="334"></A>
(<I>floating</I><A NAME="336"></A>, ks. s. <A HREF="node11.html#Kelluva-yksikko">8</A>)
sanayksik&#246;it&#228;, joita ei ole kohdistettu oikeisiin aikav&#228;leihin, vaan
jaettu tasaisesti kyseisen puhunnoksen ajalle.

<P>
Sanakerroksen rajan ei tarvitse v&#228;ltt&#228;m&#228;tt&#228; aina osua yksiin &#228;&#228;nnetason
rajan kanssa, mutta jokaisen sanarajan tulee osua yksiin jonkin tavurajan
kanssa, mik&#228;li tavutaso on annotoitu.

<P>

<H3><A NAME="SECTION03322100000000000000">
4.2.0.1 Geminaatta (kaksoiskonsonantti) sanarajalla</A>
</H3>

<P>
Jos suomenkielisess&#228; puheessa sanarajalla esiintyy geminaatta (kaksoiskonsonantti),
joka on selv&#228;sti seurausta alku- tai loppukahdennuksesta, koko konsonanttisegmentti
merkit&#228;&#228;n kuuluvaksi vain yhteen sanaan. Jos suomenkielisess&#228; puheessa
sanarajalla esiintyy geminaatta (kaksoiskonsonantti), joka ei v&#228;ltt&#228;m&#228;tt&#228;
johdu em. kahdennuksesta, sanaraja merkit&#228;&#228;n joko keskelle konsonantti&#228;&#228;nnett&#228;
tai mahdollisuuksien mukaan jollakin akustisella kriteerill&#228; perusteltuun
kohtaan konsonanttisegmentin sis&#228;ll&#228;.

<P>

<H3><A NAME="SECTION03322200000000000000">
4.2.0.2 Pitk&#228; vokaali sanarajalla</A>
</H3>

<P>
Jos suomenkielisess&#228; puheessa sanarajalla esiintyy pitk&#228; vokaali&#228;&#228;nne
siten, ett&#228; edellinen sana p&#228;&#228;ttyy samaan vokaaliin jolla seuraava
alkaa: Etsi ensin akustisia vihjeit&#228; sanarajasta vokaalisegmentin
keskelt&#228;. Toisinaan sopivan sanarajakohdan voi l&#246;yt&#228;&#228; perustaajuusmuutosten
tai &#228;&#228;nenlaatumuutosten perusteella. Rajalla voi olla esim. narinaa,
liev&#228; puristussupistuma tai per&#228;ti glottaaliklusiili. Jos rajakohdan
paikkeilla on narinainen &#34;kuoppa&#34;, merkitse raja
pisimm&#228;n &#228;&#228;nihuuliperiodin j&#228;lkeen, juuri ennen kuin perustaajuus
alkaa j&#228;lleen nousta. T&#228;llainen rajakohta heijastuu usein my&#246;s vokaalin
laatuun. Jos sanojen rajalla on glottaaliklusiili, glottaaliklusiilin
sulkeumavaihe kuuluu edelliseen sanaan ja sen j&#228;lkeinen &#34;laukeama&#34;
seuraavaan sanaan. Jos glottaaliklusiili on eritt&#228;in pitk&#228; ja sanarajalla
tuntuu olevan esim. ep&#228;r&#246;inti&#228;, &#228;l&#228; merkitse glottaaliklusiilin sulkeumaa
kumpaankaan sanaan kuuluvaksi, vaan j&#228;t&#228; se kokonaan sanojen ulkopuolelle.
Huom. Glottaaliklusiilin sulkeuma kuuluu kuitenkin puhunnokseen, sill&#228;
se on selv&#228;sti puhujan tuottama artikulaatio! Jos mit&#228;&#228;n akustisia
vihjeit&#228; ei l&#246;ydy, merkitse sanaraja keskelle vokaalisegmentti&#228;.

<P>

<H3><A NAME="SECTION03322300000000000000">
4.2.0.3 Puhunnoksenloppuiset/-alkuiset saneet</A>
</H3>

<P>
Jos puhunnos p&#228;&#228;ttyy soinnittomaan vaiheeseen ja viimeisen sanan lopussa
on [h]-mainen &#228;&#228;nne, t&#228;m&#228; merkit&#228;&#228;n kuuluvaksi puhunnokseen, muttei
viimeiseen saneeseen. Siihen saakka kun [h]-&#228;&#228;nne on selv&#228;sti
viimeisen saneen viimeisen vokaalin v&#228;rinen (&#34;soinniton vokaali&#34;),
se kuuluu my&#246;s saneeseen. T&#228;llaisessa tapauksessa &#228;&#228;nne segmentoidaan
my&#246;s osaksi puhunnoksen viimeist&#228; vokaalisegmentti&#228;, mutta segmentin
soinniton osa merkit&#228;&#228;n &#228;&#228;nenlaatutasolle soinnittomaksi.

<P>

<H2><A NAME="SECTION03323000000000000000">
Riippuvuudet muista yksik&#246;ist&#228;</A>
</H2>

<P>
Puhunnos, fooniyksik&#246;t ja tavut, mik&#228;li ne ovat olemassa.

<P>

<H2><A NAME="SECTION03324000000000000000">
Kuvauksen valinta</A>
</H2>

<P>
Merkit&#228;&#228;n ainakin saneen l&#228;hes ortografinen litteraatti (ts. sama
asu kuin foneettisen puhunnoksen kuvauksessa); mahdollisesti my&#246;s
muita piirteit&#228;. Sanarajat ylitt&#228;vi&#228; suomen ortografiassa n&#228;kym&#228;tt&#246;mi&#228;
assimilaatioita (esim. <I>poja</I><I><U>m</U></I> <I>pallo</I>)
ei tarvitse merkit&#228;, sill&#228; ne voidaan todeta &#228;&#228;nnekerroksen annotaatiosta
ja/tai tuottaa s&#228;&#228;nt&#246;pohjaisesti. Keskener&#228;iseksi j&#228;&#228;neen sanan loppuun
merkit&#228;&#228;n tavuviiva <I>-</I>.

<P>
Jollet k&#228;yt&#228; annotaatiossa Puh-editoria, merkitse kaikki sanayksikk&#246;&#246;n
liittyv&#228;t piirteet omiin kerroksiinsa. Esimerkiksi Praat-ohjelmalla
rajataan saneet yhteen IntervalTier-tyyppiseen kerrokseen ja kirjoitetaan
n&#228;iden nimikkeiksi saneen litteraatti. Sen j&#228;lkeen luodaan PointTier-tyyppinen
kerros esimerkiksi sanan perusmuodolle, ja lis&#228;t&#228;&#228;n t&#228;h&#228;n kerrokseen
yksi ankkuri (point) jokaisen saneen keskivaiheille. Ankkureiden nimikkeiksi
annetaan sitten ko. saneen perusmuoto ortografisessa asussaan.

<P>
Sanalle ei ole m&#228;&#228;ritelty valmiiksi esimerkiksi ominaisuutta 'sanaluokka',
sill&#228; ominaisuudet periytyv&#228;t kaikille yksik&#246;n aliyksik&#246;ille ja eri
tutkijoiden k&#228;sitykset sanaluokkien m&#228;&#228;r&#228;st&#228; ja merkityksest&#228; vaihtelevat
(esim. <A
 HREF="node62.html#ISK">15</A> vs. erilaisten automaattisten morfologisten
analyysity&#246;kalujen k&#228;ytt&#228;m&#228;t luokitukset). Mik&#228;li sanaluokan annotointi
on tarpeen, kannattaa luoda Puh-editorissa sanayksik&#246;lle uusi aliyksikk&#246;,
jolle m&#228;&#228;ritell&#228;&#228;n sanaluokka-ominaisuus ja t&#228;lle puolestaan lista
haluttuja luokkanimikkeit&#228;.

<P>
<HR>
<!--Navigation Panel-->
<A NAME="tex2html1021"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html1015"
  HREF="node18.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html1009"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html1017"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html1019"
  HREF="node63.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<B> :</B> <A NAME="tex2html1022"
  HREF="node21.html">4.3 Syllable - tavu</A>
<B> :</B> <A NAME="tex2html1016"
  HREF="node18.html">4. Lingvistiset yksiköt</A>
<B> :</B> <A NAME="tex2html1010"
  HREF="node19.html">4.1 Phoneme - foneemi</A>
 &nbsp <B>  <A NAME="tex2html1018"
  HREF="node1.html">Sis&auml;lt&ouml;</A></B> 
 &nbsp <B>  <A NAME="tex2html1020"
  HREF="node63.html">Hakemisto</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Mietta Lennes
2005-05-11
</ADDRESS>
</BODY>
</HTML>
