<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//FI">

<!--Converted with jLaTeX2HTML 2002 (1.62) JA patch-1.4
patched version by:  Kenshi Muto, Debian Project.
LaTeX2HTML 2002 (1.62),
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>3.2 Phone - fooni,
äänne</TITLE>
<META NAME="description" CONTENT="3.2 Phone - fooni,
äänne">
<META NAME="keywords" CONTENT="annotation_guide">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="jLaTeX2HTML v2002 JA patch-1.4">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="annotation_guide.css">

<LINK REL="next" HREF="node17.html">
<LINK REL="previous" HREF="node15.html">
<LINK REL="up" HREF="node14.html">
<LINK REL="next" HREF="node17.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html907"
  HREF="node17.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html901"
  HREF="node14.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html895"
  HREF="node15.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html903"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html905"
  HREF="node63.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<!--End of Navigation Panel-->
<!--Table of Child-Links-->
<A NAME="CHILD_LINKS"><STRONG>Aliluvut</STRONG></A>

<UL>
<LI><A NAME="tex2html909"
  HREF="node16.html#SECTION03221000000000000000">Määritelmä ja käyttötarkoitus</A>
<LI><A NAME="tex2html910"
  HREF="node16.html#SECTION03222000000000000000">Paikantaminen ja rajaaminen</A>
<UL>
<LI><A NAME="tex2html911"
  HREF="node16.html#SECTION03222010000000000000">Tee rajaus seuraavien periaatteiden mukaisesti:</A>
</UL>
<BR>
<LI><A NAME="tex2html912"
  HREF="node16.html#SECTION03223000000000000000">Riippuvuudet muista yksiköistä</A>
<LI><A NAME="tex2html913"
  HREF="node16.html#SECTION03224000000000000000">Kuvauksen valinta</A>
</UL>
<!--End of Table of Child-Links-->
<HR>

<H1><A NAME="SECTION03220000000000000000"></A><A NAME="sub:Phone-fooni-aanne"></A><A NAME="236"></A><A NAME="237"></A><A NAME="238"></A>
<BR>
3.2 Phone - fooni,
&#228;&#228;nne
</H1>

<P>

<H2><A NAME="SECTION03221000000000000000">
M&#228;&#228;ritelm&#228; ja k&#228;ytt&#246;tarkoitus</A>
</H2>

<P>
Puhe&#228;&#228;nne eli fooni on tietyntyyppisen artikulaatioliikkeen abstraktio.
Yleens&#228; &#228;&#228;nteiden luokittelussa k&#228;ytet&#228;&#228;n jotakin yleisesti tunnettua
transkriptioj&#228;rjestelm&#228;&#228;, esimerkiksi kansainv&#228;list&#228; foneettista aakkostoa
(<I>International Phonetic Alphabet</I> eli <I>IPA</I><A NAME="242"></A>),
joka m&#228;&#228;rittelee, mink&#228;laiset artikulatoriset piirteet ovat t&#228;rkeit&#228;
ja voivat esiinty&#228; maailman kieliss&#228; ja kuinka n&#228;it&#228; tulisi merkit&#228;.
&#196;&#228;nteiden segmentointi ja foneettisen transkription tekeminen vaatii
runsaasti harjoittelua ja perehtymist&#228; artikulaatiofonetiikkaan.

<P>
&#196;&#228;nteit&#228; voidaan luokitella ja kuvata k&#228;ytt&#246;tarkoituksesta riippuen
eri tarkkuuksilla. &#196;&#228;nteiden nimikointi perustuu ensisijaisesti havaintoon,
mutta akustisia kuvauksia on aina syyt&#228; k&#228;ytt&#228;&#228; apuna erityisesti
&#228;&#228;nnerajojen paikantamisessa.

<P>

<H2><A NAME="SECTION03222000000000000000">
Paikantaminen ja rajaaminen</A>
</H2>

<P>
Tunnistetaan ensin sek&#228; kuulonvaraisesti ett&#228; akustisten kuvausten
perusteella &#228;&#228;nne ja sen naapuri&#228;&#228;nteet. &#34;Zoomaa&#34;
&#228;&#228;nen visualisointia niin, ett&#228; ruudulla on n&#228;kyviss&#228; vain 3-10
&#228;&#228;nteen mittainen p&#228;tk&#228; ja aaltomuotokuvaajan pienemm&#228;tkin &#34;ripellykset&#34;
erottuvat selv&#228;sti. Kuuntele eri mittaisia p&#228;tki&#228; n&#228;kyviss&#228; olevalta
alueelta, jotta l&#246;yd&#228;t &#228;&#228;nteet paremmin. &#196;&#228;nne pit&#228;&#228; aina tunnistaa
kuuntelemalla sit&#228; kontekstissaan. Jos segmentti&#228; kuuntelee yksin&#228;&#228;n,
sen tarkkaa laatua ei useinkaan voi havaita oikein, ja segmentin alussa
ja lopussa voi kuulua h&#228;iritsevi&#228; naksahduksia, jolleiv&#228;t segmenttirajat
ole tarkasti amplitudin nollakohdissa.

<P>
T&#228;m&#228;n j&#228;lkeen asetetaan alku- ja loppurajat &#228;&#228;nteen tyypin mukaisesti
(ks. esimerkit liitteess&#228; <A HREF="node59.html#cha:Aanteiden-segmentointiesimerkkeja">C</A>). 

<P>
Jos &#228;&#228;nneyksik&#246;it&#228; tuntuu l&#246;ytyv&#228;n odotetusta poikkeava lukum&#228;&#228;r&#228;,
on parasta uskoa havaintoaan ja valita n&#228;ille yksik&#246;ille parhaiten
sopivat symbolit. On huonompi ratkaisu sijoittaa &#228;&#228;nteiden rajat mielivaltaiselta
tuntuviin paikkoihin ja k&#228;ytt&#228;&#228; niille huonosti sopivia symboleita.

<P>
Mik&#228;li &#228;&#228;nne tuntuu olevan esimerkiksi vain yhden &#228;&#228;nihuuliperiodin
mittainen tai eritt&#228;in lyhytkestoinen (esim. alle 10 ms), sit&#228; ei
normaalitapauksessa kannata rajata erillisen&#228; &#228;&#228;nteen&#228; vaan jommankumman
naapurinsa osana.

<P>
Mik&#228;li vokaali&#228;&#228;nne on selv&#228;sti diftongi (tavunsis&#228;inen vokaalijono),
rajataan sen alku- ja loppuosa erillisin&#228; &#228;&#228;ntein&#228;. Huomaa kuitenkin,
ett&#228; joskus fonologisessa mieless&#228; odottamasi diftongi saatetaan tuottaa
monoftongina - &#228;l&#228; silloin pakota segmentti&#228; kahteen osaan. Samat
neuvot koskevat tavurajan ylitt&#228;vi&#228; vokaaliyhtymi&#228;.

<P>
Pitki&#228; foneemeja edustavat &#228;&#228;nteet rajataan vain yhten&#228; &#228;&#228;nnesegmenttin&#228;.
Esim. pitk&#228; /k:/-konsonantti rajataan samalla tavalla kuin lyhyt /k/,
sill&#228; &#228;&#228;nnekerroksessa n&#228;ill&#228; ei v&#228;ltt&#228;m&#228;tt&#228; ole selv&#228;&#228; foneettista
eroa. (Huom: Vain yksi [k] segmentoidaan my&#246;s, vaikka l&#246;yt&#228;isit
aaltomuotokuvasta pitk&#228;hk&#246;n [k]-&#228;&#228;nteen keskelt&#228; useita laukeaman
n&#228;k&#246;isi&#228; ''sykkyr&#246;it&#228;''! On hyvin tavallista, ett&#228; [k]-klusiilin
laukeama on ep&#228;m&#228;&#228;r&#228;inen, sill&#228; kielen selk&#228; on pinta-alaltaan suuri
ja sen liikuttelu artikuloidessa on luonnostaan v&#228;hemm&#228;n tarkkaa kuin
esimerkiksi kielen k&#228;rjen.)

<P>

<H4><A NAME="SECTION03222010000000000000">
Tee rajaus seuraavien periaatteiden mukaisesti:</A>
</H4>

<P>

<OL>
<LI>Sijoita raja auditiivisin perustein kohtaan, jossa rajan vasemmalla
puolella olevaa osiota kuunnellessa rajaa seuraava &#228;&#228;nne ei viel&#228;
erotu kuulohavainnon perusteella ja rajan oikealla puolella olevaa
osiota kuunnellessa et erota mik&#228; edellinen &#228;&#228;nne on.
</LI>
<LI>Tarkenna auditiivisin perustein tekem&#228;&#228;si rajausta siirt&#228;m&#228;ll&#228; rajaa
akustisin perustein l&#246;ytyneeseen muutoskohtaan, jos t&#228;m&#228; on tarpeen
eik&#228; aiheuta kovin suurta muutosta rajan paikkaan.
</LI>
<LI>Kun rajan paikka on suunnilleen l&#246;ytynyt, noudata lis&#228;ksi seuraavia
s&#228;&#228;nt&#246;j&#228; aina, kun se on tarkoituksenmukaista (ts. kun raja ei edelliseen
kohtaan n&#228;hden siirry kohtuuttomasti):

<P>

<OL>
<LI>Jos &#228;&#228;nne on soinnillinen, sijoita raja &#228;&#228;nihuuliperiodin alkuun.
Soinnillisuuden tunnistat siit&#228;, ett&#228; aaltomuodossa n&#228;kyy l&#228;hes samanlaisina
toistuvia kuvioita
</LI>
<LI>Sijoita raja &#228;&#228;nisignaalin nollakohtaan, ts. kohtaan, jossa aaltomuotok&#228;yr&#228;
ylitt&#228;&#228; vaakasuoran nollarajan.
</LI>
<LI>Sijoita raja kohtaan, jossa aaltomuotok&#228;yr&#228; nousee yl&#246;sp&#228;in.
</LI>
<LI>Sijoita raja jonkin oheisen esimerkin mukaisesti.
</LI>
</OL>
</LI>
</OL>
Esimerkkej&#228; eri &#228;&#228;nteiden v&#228;listen rajojen sijoittamisesta on liitteess&#228;
<A HREF="node59.html#cha:Aanteiden-segmentointiesimerkkeja">C</A>.

<P>

<H2><A NAME="SECTION03223000000000000000">
Riippuvuudet muista yksik&#246;ist&#228;</A>
</H2>

<P>
&#196;&#228;nnesegmentti liittyy suoraan signaaliin tai kaikkiin signaaleihin,
joissa &#228;&#228;nne esiintyy samalla hetkell&#228; saman puhujan tuottamana. Mik&#228;li
puhunnos-, tavu- ja sanekerrokset ovat ennest&#228;&#228;n olemassa, tulisi
puhunnosten, tavujen ja saneiden alku- ja loppurajat soveltuvin osin
kohdistaa vastaavien &#228;&#228;nnerajojen kanssa. Huomaa kuitenkin, ett&#228; usein
esiintyy my&#246;s &#228;&#228;nteit&#228;, jotka ylitt&#228;v&#228;t tavu- tai sanarajan ja joita
ei siksi voida perustellusti sitoa vain yhteen tavu- tai saneyksikk&#246;&#246;n
(esim. suomen kielen geminaatta tai sanojen rajalla esiintyv&#228; vokaali&#228;&#228;nne,
johon edellinen sana loppuu ja jolla seuraava sana saumattomasti alkaa).

<P>

<H2><A NAME="SECTION03224000000000000000">
Kuvauksen valinta</A>
</H2>

<P>
Ensisijaisesti kuulonvaraisin, mutta osittain akustisin kriteerein
valitaan kyseist&#228; &#228;&#228;nnett&#228; kuvaava symboli ja tarkkeet kansainv&#228;lisen
foneettisen aakkoston (IPA, <A
 HREF="node62.html#IPAHandbook">4</A>) k&#228;ytt&#228;mien foneettisten
piirteiden mukaisesti. 

<P>
Sama &#228;&#228;nne voidaan kuvata foneettisesti joko ASCII-muotoisena (Worldbet-
ja X-SAMPA-aakkostot) tai mahdollisesti IPA-kirjasimella, mik&#228;li k&#228;ytett&#228;v&#228;
annotointiohjelma sen sallii. ASCII-muotoisia aakkostoja tulisi suosia,
koska ne ovat koneluettavia ja koska niiden siirto j&#228;rjestelm&#228;st&#228;
toiseen aiheuttaa v&#228;hiten muunnosongelmia. Jos annotaatioista halutaan
my&#246;hemmin luoda esitysgrafiikkaa, ASCII-muodossa kuvatut &#228;&#228;nteet voidaan
muuntaa IPA-kirjasimelle. Worldbet-aakkoston merkit on kuvattu liitteess&#228;
<A HREF="node56.html#sec:Worldbet-symbolit">A</A>.

<P>
Pyri l&#246;yt&#228;m&#228;&#228;n &#228;&#228;nnett&#228; parhaiten kuvaava foneettinen perussymboli.
Lis&#228;&#228; t&#228;m&#228;n j&#228;lkeen tarvittavat tarkemerkit. Jokaiselle &#228;&#228;nnesegmentille
saa antaa vain yhden foneettisen perussymbolin tarkkeineen. Jos tunnet
tarvitsevasi useamman perussymbolin, rajaa jokaiselle oma segmenttins&#228;.

<P>
Foneettisen transkription pit&#228;isi kuvata mahdollisimman tarkasti &#228;&#228;nteest&#228;
syntyv&#228;&#228; kuulohavaintoa. Pyri siis v&#228;ltt&#228;m&#228;&#228;n tietoista tai tiedostamatonta
tukeutumista esimerkiksi foneemiseen kuvaukseen. Kun mietit, mik&#228;
transkriptio ts. nimike &#228;&#228;nteelle sopisi, ajattele &#228;&#228;nt&#246;v&#228;yl&#228;n asentoa
ja sit&#228;, mihin suuntiin artikulaatioelimet ovat matkalla. T&#228;m&#228; voi
helpottaa ep&#228;selvien &#228;&#228;nteiden nimikointia.

<P>
<HR>
<!--Navigation Panel-->
<A NAME="tex2html907"
  HREF="node17.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html901"
  HREF="node14.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html895"
  HREF="node15.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html903"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html905"
  HREF="node63.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<B> :</B> <A NAME="tex2html908"
  HREF="node17.html">3.3 VoiceQuality - äänenlaatu</A>
<B> :</B> <A NAME="tex2html902"
  HREF="node14.html">3. Foneettiset yksiköt</A>
<B> :</B> <A NAME="tex2html896"
  HREF="node15.html">3.1 PhoneticUtterance - puhunnos</A>
 &nbsp <B>  <A NAME="tex2html904"
  HREF="node1.html">Sis&auml;lt&ouml;</A></B> 
 &nbsp <B>  <A NAME="tex2html906"
  HREF="node63.html">Hakemisto</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Mietta Lennes
2005-05-11
</ADDRESS>
</BODY>
</HTML>
